package com.xsc.coder.program.y22.m08;

import java.util.ArrayList;

/**
 * 描述
 * 给定一个长度为 n 的数组 nums 和滑动窗口的大小 size ，找出所有滑动窗口里数值的最大值。
 * <p>
 * 例如，如果输入数组{2,3,4,2,6,2,5,1}及滑动窗口的大小3，那么一共存在6个滑动窗口，他们的最大值分别为{4,4,6,6,6,5}； 针对数组{2,3,4,2,6,2,5,1}的滑动窗口有以下6个： {[2,3,4],2,6,2,5,1}， {2,[3,4,2],6,2,5,1}， {2,3,[4,2,6],2,5,1}， {2,3,4,[2,6,2],5,1}， {2,3,4,2,[6,2,5],1}， {2,3,4,2,6,[2,5,1]}。
 * <p>
 * 数据范围： 1 \le size \le n \le 100001≤size≤n≤10000，数组中每个元素的值满足 |val| \le 10000∣val∣≤10000
 * 要求：空间复杂度 O(n)O(n)，时间复杂度 O(n)O(n)
 * <p>
 * <p>
 * 示例1
 * 输入：
 * [2,3,4,2,6,2,5,1],3
 * 复制
 * 返回值：
 * [4,4,6,6,6,5]
 * 复制
 * 示例2
 * 输入：
 * [9,10,9,-7,-3,8,2,-6],5
 * 复制
 * 返回值：
 * [10,10,9,8]
 * 复制
 * 示例3
 * 输入：
 * [1,2,3,4],3
 * 复制
 * 返回值：
 * [3,4]
 *
 * @author xia
 * @date 2022/8/30 23:27
 */
public class MaxInWindows {

    public ArrayList<Integer> maxInWindows(int[] num, int size) {

        return null;
    }

}
